{
    "data": [
        {
            "topic": "Chemical formula",
            "text": "A chemical formula (or molecular formula) is one way chemists describe a molecule. The formula says what atoms, and how many of each type, are in the molecule. Sometimes the formula shows how the atoms are linked, and sometimes the formula shows how the atoms are arranged in space."
        },
        {
            "topic": "Angels & Demons",
            "text": "Angels & Demons is a book by American author Dan Brown. This book follows the Story of Robert Langdon, the professor who studies about mysterious codes and ancient societies. The main subject of the book is how Robert Langdon, with the help of the beautiful scientist Vittoria Vetra, search for the container of a dangerous substance named antimatter that would destroy the Vatican city at midnight, and rescue the four cardinals in the day of the Conclave. To find the container and rescue the cardinals, Langdon and Vittoria have to follow the 'Path of Illumination', that is marked by sculptures made by a member of illuminati - Bernini, each of them representing one of the elements of science, Earth, Air, Fire and Water. In the end they are able to rescue only 1 cardinal and the antimatter is lifted into the sky where it explodes harmlessly."
        },
        {
            "topic": "Columbidae",
            "text": "A dove is a kind of bird in the pigeon family, Columbidae. The names pigeon and dove are often used both for the same meaning. However, there is a small difference. Doves have a smaller body, and they have longer tails. Sometimes, though, there can be exceptions. The domestic pigeon is frequently called the 'rock dove'. This bird is called the 'dove of peace.' Pigeons and doves both have thick bodies and short necks with short, narrow bills. They live in lots of places, but most of them are in places such as Indonesia and Australia. The young doves and pigeons are called 'squabs.' There are more than 300 species of doves. The nests of doves are usually made of sticks. Their two white eggs are incubated by both the male and the female parent. Doves feed on seeds, fruit and plants. Unlike most other birds, the doves and pigeons produce a type of milk. Both sexes have this kind of highly nutritious milk to feed to the young."
        },
        {
            "topic": "Natural resource",
            "text": "A natural resource is anything people can use which comes from nature. People do not make natural resources, but gather them from the earth. Examples of natural resources are air, water, wood, oil, solar energy, wind energy, hydro-electric energy, and coal. Refined oil is not a natural resource because people make it."
        },
        {
            "topic": "San Gabriel Mountains",
            "text": "The San Gabriel Mountains are a mountain range in southern California, in the United States. They are in both Los Angeles County and San Bernardino County. Mount San Antonio is the highest point in the mountains range, standing 10,064 feet (3,067 m) tall. The mountains separate the basin of Los Angeles in the south from the Mojave Desert in the north. The San Gabriel River and Los Angeles River are the major rivers that receive water from the mountains. California State Route 2 is the major highway that runs through the San Gabriel Mountains."
        },
        {
            "topic": "Businessperson",
            "text": "A businessperson (also businessman or businesswoman) is someone who works at a job that focuses on making money. Generally, it is someone who works in the management (at any level) of a company. Businessperson is used more commonly than in the past, in place of the words businessman or businesswoman to avoid sexism and stereotypes. Sometimes the words businessman or businesswoman are used to point out a man or woman."
        },
        {
            "topic": "Video game",
            "text": "Video games are electronic games played on a video screen (normally a television, a built-in screen when played on a handheld machine, or a computer).There are many types, or genres, of these games: role-playing games; shooters, first-person shooters, side-scrollers, and platformers are just a few.Video games usually come on CDs, DVDs or digital download now, but many games used to come on cartridges. Some games can also be downloaded from the internet. The device used to play a video game at home is called a console. There have been many types of consoles and home computers used to play video games. Some of the first were the Atari 2600, the Sega Master System and Nintendo Entertainment System in the 1980s. Newer video game consoles are the Xbox 360, PlayStation 3, and Wii. The best selling video game console of all time is the PlayStation 2, made by Sony."
        },
        {
            "topic": "Ingo Rechenberg",
            "text": "Ingo Rechenberg' (born January 20 1934 in Berlin) is a German computer scientist and professor. Rechenberg is a pioneer of the fields of evolutionary computation and artificial evolution. In the 1960s and 1970s he invented a highly influential set of optimization methods known as evolution strategies (from German Evolutionsstrategie). His group successfully applied the new algorithms to challenging problems such as aerodynamic wing design. These were the first serious technical applications of artificial evolution, an important subset of the still growing field of bionics."
        },
        {
            "topic": "Deep Impact (spacecraft)",
            "text": "Deep Impact was a NASA space mission to study comets.[1] It was sent out to meet Comet Tempel 1, and to crash a smaller space rocket deep into the comet's surface. Deep Impact was launched on January 12, 2005 from the Cape Canaveral Air Force Station at Cape Canaveral, Florida. The rocket used was a Boeing Delta II.[2] It reached the comet in July 2005, 83,000,000 mi (133,575,552 km) from Earth. After taking photos, the 370 kg (816 lb) impactor spacecraft was sent to crash into the surface on July 4, 2005.[1] This created a huge crater and blasted parts of the comet into space. Deep Impact was able to study this debris which included ice and dust from deep inside the comet. This has helped scientists understand what comets are made of."
        },
        {
            "topic": "Night",
            "text": "Night or nighttime is the time when the Sun is not in the sky. Night happens after Dusk and before Dawn. The opposite of night is day. The start and end times of night are different in different geographic locations. It varies on season, latitude, longitude and timezone. In popular culture, night is often thought of as a symbol of evil, possibly because of the fear of the dark or possibly because of the lack of visibility. In other Timezones, the night occurs at different times. This is because the Sun shines on different parts of the Earth at different times."
        },
        {
            "topic": "Pteridospermatophyta",
            "text": "The term seed ferns (Pteridospermatophyta) refers to several distinct groups of extinct seed plants (spermatophytes).The oldest fossil evidence of plants of this type is from Upper Devonian strata,[1] and they flourished particularly during the Carboniferous and Permian periods.Pteridosperms declined during the Mesozoic Era and had mostly disappeared by the end of the Cretaceous, though some fossil pteridosperm-like plants seem to have survived into Eocene times in Tasmania."
        },
        {
            "topic": "Gymnastics",
            "text": "Gymnastics is a sport which involves running, jumping, tumbling, somersaulting, and balancing. For girls, there are four pieces of equipment that the gymnasts do tricks on: floor, bars, beam and vault. For boys, there are six pieces of equipment that the gymnasts do tricks on: floor, parallel bars, high bar, pommel horse, vault and the rings. Gymnasts can compete with other gymnasts to see who can do their tricks are better. Usually the winner gets a trophy, ribbon, or a medal. Gymnastics is an Olympic sport."
        },
        {
            "topic": "Cronus",
            "text": "Kronos (also Cronos or Cronus) is a Titan in Greek mythology. He is the Titan of time. His parents are Gaia (the Earth) and Uranus (the sky). Uranus was very vain and he cast the Cyclops and hundred handed ones into Tarturus (a deep pit), but Gaia wanted all her children to live in peace so she told the Titans to kill Uranus and she gave them a really sharp scythe, which Kronos took. While Kronos's brothers held the sky he slashed it open with the scythe and he became lord of the universe, but he had too much of his father in him so he kept his brothers locked in Tarturus. With his sister and wife Rhea his children are Demeter, Hades, Hera, Hestia, Poseidon, and Zeus. Kronos became so angry about his children's power, and had been warned by Gaia, or mother earth, that one of his children would overthrow him. Because of this, he decided to eat them so he could obtain their power and stop the risk of the end of his reign. He ate all but Zeus because Rhea hid baby Zeus and gave Kronos a rock instead. Later, when Zeus was grown, he fed Kronos a mixture of mustard and wine and made him throw up his children. The reason they all survived in Kronos's stomach was because they were gods and goddesses, they were immortal. Zeus and his siblings were angry and Kronos was angry as well, they started the great war among the Titans and the gods. No one was winning the war and no one was losing, so Zeus asked Rhea for help. Rhea suggested they free the other Titans, who Kronos locked away because they were too dangerous. The Titans were so happy to be freed from Tartarus, they helped Zeus win the war. But, sadly, afterwards the other Titans thought they should have some power, but Zeus became head of the gods. The Titans refused to help Zeus further and planned revenge, only to fail against the king."
        },
        {
            "topic": "Health",
            "text": "Health is 'a state of complete physical, mental, and social well-being and not merely the absence of disease' according to the World Health Organization (WHO). [1][2] Physical is about the body. Mental is about how people think and feel. Social talks about how people live with other people. It is about family, work, school, and friends."
        },
        {
            "topic": "Jackanory",
            "text": "Jackanory is a long-running BBC children's television series. It was made to interest children in reading. The show began on 13 December 1965. The first story was the fairy-tale Cap-o'-Rushes read by Lee Montague. Jackanory continued to be broadcast until 1996. They made around 3,500 episodes in its 30-year run. The final story, The House at Pooh Corner by A. A. Milne, was read by Alan Bennett. It was broadcast on 24 March 1996. The show returned on 27 November 2006 for two stories."
        },
        {
            "topic": "Mare Tranquillitatis",
            "text": "Mare Tranquillitatis is a large area on the visible side of the Moon. It is also called the Sea of Tranquillity. It is called a sea because ancient astronomers looked at the Moon and thought they saw seas and oceans on the Moon. Now we know that they are not seas. They are darkened areas on the Moon's surface. They may have been made by ancient volcanoes by things such as leaks and eruptions. Mare Tranquillitatis is just one of the 22 'Seas' and 'Oceans' on the Moon."
        },
        {
            "topic": "Breast cancer",
            "text": "Breast cancer is a type of cancer that happens to the breast. In the world, breast cancer is the fifth most common cause of cancer death. The first four are lung cancer, stomach cancer, liver cancer, and colon cancer. In 2005, breast cancer caused 502,000 deaths (7% of cancer deaths; almost 1% of all deaths) in the world.[1] Among all women in the world, breast cancer is the most common cancer.[1] In the United States, breast cancer is the most common cancer in women, and the second most common cause of cancer death in women (after lung cancer). In 2007, breast cancer caused about 40,910 deaths (7% of cancer deaths; almost 2% of all deaths) in the U.S.[2][3] Women in the United States have a 1 in 8 chance of getting breast cancer in their lives. They have a 1 in 33 chance of death from breast cancer"
        },
        {
            "topic": "Constellation",
            "text": "A constellation is a group of stars, usually in a recognizable shape or pattern. Together, the stars look like a picture. The word constellation comes from Latin: con-, meaning together and stella- meaning stars. Some examples of constellations are Ursa Major, Orion, and Andromeda. People used constellations to tell the difference in the colors.constellations were also used to group stars.Different places in the world may have different constellations, but today astronomy has a fixed set of 88 constellations. This set is based on the Greek set and later some southern constellations were added, for example Antlia - the air pump. Most constellations have names that come from Greek mythology, like Orion or Andromeda."
        },
        {
            "topic": "Republicanism",
            "text": "Republicanism is the ideology of governing a nation as a republic with an emphasis on liberty and the civic virtue practiced by citizens. Republicanism always stands in opposition to aristocracy, oligarchy, and dictatorship. More broadly, it refers to a political system that protects liberty, especially by incorporating a rule of law that cannot be arbitrarily ignored by the government. According to John Adams, “They define a republic to be a government of laws, and not of men.” Much of the literature deals with the issue of what sort of values and behavior by the citizens is necessary if the republic is to survive and flourish; the emphasis has been on widespread citizen participation, civic virtue, and opposition to corruption."
        },
        {
            "topic": "Biomass (ecology)",
            "text": "In ecology, biomass means the cumulation of living matter. That is, it is the total living biological material in a given area or of a biological community or group. Biomass is measured by weight, or by dry weight, per given area (usually measured per square metre or square kilometre). The most successful animal, in terms of biomass, is the Antarctic krill, Euphausia superba, with a biomass of probably over 500 million tons, roughly twice the total biomass of humans. Biomass may also be a measure of the dried organic mass of an ecosystem."
        },
        {
            "topic": "British Empire",
            "text": "The British Empire was a global power that contained territories owned by the United Kingdom. The empire was the largest empire in history, and at its peak controlled 23% of the world's surface. More than 458 million people were brought under the control of the British Empire. It was known as the largest colonial empire in history. (Some people think the Mongol Empire was larger). Today, most of its members are in the Commonwealth of Nations. The most famous part of the British Empire was the East India Trading Company, which started out as a small business before becoming a very large trading company which many people depended on. Britain was the most powerful country in the world at this time."
        },
        {
            "topic": "Color blindness",
            "text": "People with color blindness[1] cannot tell the difference between certain colors, or they may not see colors at all. Color blindness is the name for a number of medical conditions, and doctors sometimes call color blindness colour vision deficiency. Most colour blindness is heritable, usually as simple Mendelian inheritance. More rarely, it may be the result of damage to the eyes, nerves or the brain; it can also happen because the affected person was exposed to certain chemicals. Most color blindness is permanent, but some conditions can also lead to temporary color blindness. During certain kinds of migraine, some people are unable to tell the difference between certain colors. As of 2009, there is no treatment or cure for permanent color blindness."
        },
        {
            "topic": "Howard Hughes",
            "text": "Howard Robard Hughes, Jr. (December 24, 1905 – April 5, 1976), was an American businessman and movie producer. During his life, he was one of the richest people in the world. He was born in Texas to a wealthy family. He went to Hollywood and became a movie producer and aviator. Hughes broke several world records for flying aeroplanes. He created his own air company, which was later bought by TWA. Many people now think Hughes may have had OCD or obsessive compulsive disorder. This is because later in life, he kept himself away from the outside world. He lived in a hotel suite at The Desert Inn in Las Vegas as a recluse. He never left his room. He also did not cut his hair or fingernails. He had a group of doctors and other people to help take care of him. In 1972, a man named Clifford Irving claimed to have co-written the autobiography of Hughes. It was later shown to not be real. Hughes died while being moved to a hospital in Mexico. After he died, there was an argument over his will."
        },
        {
            "topic": "Shrimp",
            "text": "Shrimp refers to small, decapod crustacea. Shrimp are mainly found in three groups: Caridea, Procarididea, and Dendrobranchiata. There are thousands of species, and usually there is a species adapted to any particular habitat. Any small crustacean which resembles a shrimp tends to be called one.[1] Adult shrimp are filter feeding benthic animals that live close to the bottom. They can live in schools and can swim rapidly backwards. Shrimp are an important food source for larger animals from fish to whales. They have a high tolerance to toxins in polluted areas, and may contribute to high toxin levels in their predators. They play important roles in the food chain and are important food sources for larger animals from fish to whales."
        },
        {
            "topic": "Bat",
            "text": "Bats are mammals in the order Chiroptera. They are the only mammals that can fly. Other mammals like flying squirrels, or flying possum, can glide but not fly. They are nocturnal – they are active during the night, dusk, or dawn. Bats use echolocation to catch prey and to find their way about. As nighttime animals, bats avoid direct competition with birds, few of which are nocturnal."
        },
        {
            "topic": "Wine",
            "text": "Wine is an alcoholic drink. The word wine is usually used to talk about drinks made from the juice of grapes, although people sometimes call alcoholic drinks made from the juice of other fruits (such as plums or blackberries) 'wine'. This article only deals with wine made from grapes. Wine is made by the fermentation of the sugar in grapes. There are two main types of wine, red wine and white wine. Red wine is made from red grapes, and white wine is made from white grapes. Rosé wine is made by leaving red grapes in skin contact for a very short time. The colour comes only from the skin, so if you have short skin contact, the wine will not turn red but only 'pink' (rose wine). Wine sometimes has bubbles in it; this wine is called sparkling wine. The most popular sparkling wine is champagne, which comes from France."
        },
        {
            "topic": "Skateboard",
            "text": "A skateboard is a board (called a 'deck') with four wheels put on under it. It is used to go skateboarding. The first skateboards were a piece of wood with rollerskates attached to it. This became popular and by 1960, skateboards were made in production. As more skateboards were made, more people liked the new sport. However, it was dangerous and people started to fall off. As a result, skateboard parks started to close down. With less places to skate, skateboarders had no where to go. A small group of skateboarders carried on skateboarding in the street and around cities. After 20 years, the sport began to grow into what we know now. Skateboarding is a popular sport. Young people sometimes skateboard on the street."
        },
        {
            "topic": "Wall Street",
            "text": "Wall Street is a street in Lower Manhattan, New York City. It runs east from Broadway to South Street on the East River and through the Financial District. It is home to the New York Stock Exchange, the world's largest stock exchange and Federal Hall. Most headquarters of many other American exchanges NYSE, NASDAQ, AMEX, NYMEX, NYBOT are also run from Wall Street."
        },
        {
            "topic": "Adder (electronics)",
            "text": "Binary adders are devices used to add binary numbers. They are used in computers. They take two binary numbers and put them together to get a sum. In its most basic form, it uses two XOR gates, two AND gates, and an OR gate. These gates figure out what the numbers being sent in mean and if the digit needs to be turned on or not. When solving this example 1001 + 1100 (9 + 12), it would need five single bits to give an answer. The first digits in each number would go to one adder, 1 and 0. It would calculate that 1 + 0 = 1, so that first digit would be 1. The second digits from each are 0 and 0, and 0 + 0 = 0, so the second digit is 0. the third digit from each are 1 and 0, and 1 + 0 = 1, so the third digit is 1. The fourth digit in each are 1 and 1, and 1 + 1 = 10, but because this is a 2 digit number, it holds the first digit (0) and send the second digit to the next adder. The next adder sees 1, and 1 = 1, so the fifth digit is 1. If we take the sum digits in order, they come out as 10101 (21), so 1001 + 1100 = 10101 (9 + 12 = 21)."
        },
        {
            "topic": "Barbados",
            "text": "Barbados is an island country in the Caribbean Sea. The island has an area of about 430 km². Its capital and largest city is Bridgetown. The official language of Barbados is English. Barbados is a popular tourist destination. In 2008, the island had a population of about 284,000 people.[6] About 80,000 live in or around Bridgetown.[7] The island is in the western area of the North Atlantic and 100 kilometres (62 mi) east of the Windward Islands and the Caribbean Sea.[8] It is about 168 kilometres (104 mi) east of the islands of Saint Vincent and the Grenadines, and 400 kilometres (250 mi) north-east of Trinidad and Tobago. Barbados is outside of the main Atlantic hurricane belt."
        },
        {
            "topic": "Kashmir",
            "text": "Kashmir (Urdu: ?????, Kashmiri: ??????), also known as Cashmere, is a region in South-central Asia. The term Kashmir historically was described as the valley just to the south of the western end of the Himalayan mountain range. Today, Kashmir refers to a much larger area that includes the regions of Kashmir Valley, Jammu region and Ladakh. The main 'Valley of Kashmir' is a low fertile area surrounded by mountains and fed by many rivers. People like it for its natural beauty and simple lifestyle. Kashmir is also a Disputed Territory. Pakistan, India and China hold parts of this region."
        },
        {
            "topic": "Victoria Cross",
            "text": "The Victoria Cross (VC) is the highest military medal given for bravery 'in the face of the enemy' to members of the defence forces of Commonwealth countries, and former British Empire territories. It is the most important medal, more important than all other orders, decorations and medals.[1] It may be given to a person of any rank in any service (army, navy or air force) or anyone working for the military. It is usually presented to the person, or a family member if they were killed, by the British monarch during a ceremony at Buckingham Palace. It can be presented by the Governor-General for awards made by other Commonwealth countries."
        },
        {
            "topic": "Anarchism",
            "text": "Anarchism is a political belief that is against authority, believing that people can organize themselves without needing state or a government in power.[1] Anarchists also believe that participation should never be forced by other people. Anarchism is 'a cluster of doctrines and attitudes centered on the belief that government is both harmful and unnecessary.'[2][3] The term 'anarchism' derives from the Greek a?a???a, 'without archons' which means 'without rulers',[1][4] not 'without laws'; it is also occasionally translated as 'without government'). In the common language, the word anarchy is often used to describe chaos or anomie. However, anarchists usually do not promote this. Rather, they define 'anarchy' as a way of relations between people. They believe that, once put into place, these relations work on their own."
        },
        {
            "topic": "Titan A.E.",
            "text": "Titan A.E. is a 2000 animated science fiction movie from Fox Animation Studios and Twentieth Century Fox. The name of the movie comes from the fictional spacecraft that is a main part of the plot. The A.E. meaning 'After Earth.' The movie was created using both hand-drawn animation and computer generated imagery. Titan A.E. did not make much money in theaters. It made only $9,376,845 during its opening weekend, and a total of $22,753,426 in theaters."
        },
        {
            "topic": "Hay",
            "text": "Hay is the general name for grass that has been cut and dried. It can then be stored in hay stacks, or squashed into rectangle shaped blocks called bales. Farmers are now rolling the hay into large round bales. Hay is mostly used as animal feed. The animals that eat hay are horses, cattle, goats, donkeys, and rabbits. Hay is fed when there is not enough pasture or rangeland on which an animal can graze. Farmers and ranchers often need to use hay in the winter time when grass is not available."
        },
        {
            "topic": "Might & Magic Heroes VI",
            "text": "Heroes of Might & Magic VI is a computer game issued by Ubisoft. It was released in October 2011. The game is the sixth episode of the Might & Magic series.Game play is turn-based strategy, with the options of single- or multi-player. It is animated. The story continues from the previous episode and is basically told in the introduction. Styles of multiplayer include hot seat offline or online over the internet. Offline and online saves are not compatible.The game looks like the 5th version. The focus of the game is battles, and to a lesser extent the adventure map. Resources found in earlier versions of the game (sulfur, diamonds or mercury) are not used in this version."
        },
        {
            "topic": "Homesickness",
            "text": "Homesickness is a feeling of unhappiness a person may have when away from home or from familiar surroundings or people. It has a similar meaning to the word nostalgia.People sometimes become homesick when they travel. They miss their own home and desperately want to go back. Children may often feel homesick, especially when they are away from their parents for the first time. Usually these feelings will go away as one gets used to the new environment, but sometimes homesickness can make a person depressed.People may easily feel homesick if they travel to an environment in which the culture is very difficult to what they are used to, and especially if a foreign language is being spoken. Children who are sent away to boarding school will very often feel homesick.A good way to help children overcome (or avoid) homesickness is to start with being away from home just for short periods, staying with people they know well, e.g. grandparents or good friends."
        },
        {
            "topic": "Cream cheese",
            "text": "Cream cheese is a soft, mild-tasting, white cheese. Sometimes it is given extra flavor by adding additional seasonings such as puréed garlic, chopped dill, or chopped olives; as well, some cream cheese has small pieces of fruit or other sweet food blended into it. Cream cheese is different from other cheese in that it is not allowed time to mature."
        },
        {
            "topic": "IMac",
            "text": "The iMac is an all-in-one personal computer that was first released in 1998. It is made by Apple Inc.. The first generation came in the famous Bondi Blue coloring featuring a 266Mhz G3 CPU and 32MB RAM and featured an IR (Infra-Red) window aligned with the right-hand speaker designed for connectivity that Apple decided not to develop due to its unpopularity on the Laptop product lines. In Late '98 Apple released the flavors of iMac, 5 new colors including Blueberry, Strawberry, Tangerine and Grape encasing 333mhz of processor power aided by doubled RAM (64MB). In 1999 the iMac and iMac DV were released carrying on the flavors in a more transparent case making the CRT's internal electronics visible. The 350 MHz or 400 MHz DV unit saw the loud cooling fans on the Tray-Loading predecessor removed entirely and slight case modification allowed for 'convection cooling' making the units virtually silent apart from the acoustics of the Hard drive. The DV saw the introduction of Wireless networking in Desktop computers, with the option to install an 802.11b Airport Card as well as the launch of Firewire technology, into the home and education markets partnered with Sony's development of iLink. The True strength of the 1999-and-beyond iMac computers and part of their modern day worth, is the sound system. A collaborative effort between apple and Harman Kardon, the 18 Watt Oddessey Transducer System integrated into the iMacs in addiction to the case design provides the richest sound of any Macintosh model. Naturally the USB connected 'iSub' 20watt Subwoofer Harman Kardon and Apple made specifically for the AG3 iMac as an optional component further enhances the sound set-up. The iMac G3 product line maintained the same case and structure design of the Slot Loading iMac and the final line were built with processor speeds of up to 700Mhz with 16MB of VRAM before the iMac G4 was released."
        },
        {
            "topic": "Personal computer",
            "text": "A personal computer (PC) is the common name for a type of computer that is most popular in offices and homes. The first PC called the 'IBM PC' was made by the company called IBM in 1981. Today, most PCs usually have a basic set of software called an operating system. The most popular operating system on PCs is Windows, sold by Microsoft Corporation. PCs made by a company called Apple Inc. can use a different system of software called Mac OS that is sold by Apple Inc."
        },
        {
            "topic": "Frost",
            "text": "Frost is ice that is formed when water vapor freezes onto a surface. It has a white, powdery appearance. It forms on outside surfaces when the temperature of air is very low. It can destroy crops. Greenhouses help to protect crops from frost."
        },
        {
            "topic": "Environment",
            "text": "Environment means all of the outside forces, events and things that act on a thing. A person's environment is made up of everything that surrounds him or her, including houses, buildings, people, animals, land, temperature, water, light, and other living and non-living things. Living things do not simply exist in their environment. They constantly interact with it. Organisms change in response to conditions in their environment. The environment consists of the interactions among plants, animals, soil, water, temperature, light, and other living and non-living things."
        },
        {
            "topic": "Samuel Adams",
            "text": "Samuel Adams (September27 (OS), 1722–October 2, 1803) was an American leader, politician, writer, and political philosopher, and one of the Founding Fathers of the United States. Adams helped gather support in the American colonies to rebel against Great Britain. This led to the American Revolution. Adams was one of the key makers of the principles of American politics. Adams, born and raised in Boston, Massachusetts, was brought up in a religious family. He was educated at Boston Latin School and Harvard College. He started his life as a businessman, but did not like his occupation. He then turned his interest to politics, and became an influential political writer. Adams urged the colonists to withdraw from Great Britain and form a new government. He told the colonies to defend their rights and liberties at town meetings in Boston. He wrote protests against Parliament's taxes against the colonies, such as the Stamp Act of 1765. Adams also organized the Boston Tea Party in 1773 and he was a member of the Continental Congress. He also fought for the Declaration of Independence at the Second Continental Congress in 1776."
        },
        {
            "topic": "Canadian English",
            "text": "Canadian English is the type of English that is used by Canadians.[1] It is often thought to be made from American English and British English, but this may be too simple of an explanation.[2] Canadian English uses few American ways to spell words, generally coming in to usage through American media. More often, British ways of spelling words is used as this is taught in the schooling system. Examples include using the British way to spell colour, flavour, plough, and programme. Sometimes the latter are spelt in the American forms, plow and program, however this is uncommon.[2] The main exception to this rule is terms related to cars and the auto industry. Because Canada's auto industry has always been dominated by American firms, Canadians use American words and spelling for such terms.[3] Canadians and Americans spell the outer rubber portion of a wheel as tire instead of tyre, put gasoline or gas in their vehicles instead of petrol, store items in the trunk instead of the boot, and may drive a truck instead of a lorry."
        },
        {
            "topic": "Sandalwood",
            "text": "Sandalwood is a nice-smelling wood and also the oil made from it. It is used for perfume and medicine. They are found in India, Australia, Indonesia, and the Pacific Islands. Its genus is Santalum. In Indonesia and Malaysia, its local name is Cendana."
        },
        {
            "topic": "Semantics",
            "text": "Semantics is the study of meaning. Meaning in this case refers to the relation between signifiers and what they stand for. Such signifiers are words, signs and symbols."
        },
        {
            "topic": "Deadlock",
            "text": "In computer science, deadlock refers to a specific condition when two or more processes are each waiting for each other to release a resource. It can also be that more than two processes are waiting for a number of resources. Deadlock is a common problem in multiprocessing where many processes share a specific type of mutually exclusive resource known as a software lock or soft lock. Computers intended for the time-sharing or real-time markets are often equipped with a hardware lock (or hard lock) which guarantees exclusive access to processes. This forces the prforcing serialized access. Deadlocks are particularly troubling because there is no general solution to avoid (soft) deadlocks."
        },
        {
            "topic": "Geostationary orbit",
            "text": "A geostationary orbit (or Geostationary Earth Orbit - GEO) is a geosynchronous orbit directly above the Earth's equator (0° latitude), with a period equal to the Earth's rotational period and an orbital eccentricity of approximately zero. A person watching from Earth sees a object in a geostationary orbit as motionless, at a fixed position in the sky. Communications satellites and weather satellites often have geostationary orbits, so that the satellite antennas that communicate with them do not have to move to track them. The ground atennas can be pointed permanently at a fixed position in the sky. With fixed 0° latitude and circularity of geostationary orbits, satellites in GEO differ in location by longitude only."
        },
        {
            "topic": "National Hurricane Center",
            "text": "The U.S. National Hurricane Center (NHC for short), is a department of the National Weather Service's Tropical Prediction Center, which is responsible for tracking and forecasting the likely behavior of tropical depressions, tropical storms and hurricanes. The NHC headquarters are in Miami, Florida. When tropical storm or hurricane conditions are predicted within 36 hours, the center issues the proper watches and warnings through the news media and NOAA Weather Radio. Although it is an organization of the United States, the World Meteorological Organization has designated the NHC as Regional Specialized Meteorological Center for the North Atlantic and eastern and central Pacific Ocean. In other words, the NHC is the central source of information for all tropical cyclone forecasts and observations happening in these areas, despite of their effect on the US."
        },
        {
            "topic": "Slogan",
            "text": "A slogan is a memorable motto or phrase. It is often used in a political, commercial, religious, and other context as a repetitive expression of an idea or purpose. The word slogan is derived from slogorn which was an Anglicisation of the Scottish Gaelic sluagh-ghairm tanmay (sluagh 'army', 'host' + gairm 'cry').[1] Slogans vary from the written and the visual to the chanted and the vulgar. Their simple rhetorical nature usually leaves little room for detail. A chanted slogan may serve more as social expression of unified purpose than as communication to an intended audience."
        }
    ]
}